Repository: LuicdLabs/OneMMC
Catalog: src/OneMMC/Strings/*/DiskManagement.resw
Source language: en_us
Languages: zh_tw

# DiskMgmt_VirtualHardDisk
source: Virtual hard disk (VHD)
zh_tw: 虛擬硬碟 (VHD)

# DiskMgmt_VirtualHardDiskDescription
source: Create, attach, or detach virtual hard disks
zh_tw: 建立、連接或中斷連接虛擬硬碟

# DiskMgmt_Attach
source: Attach
zh_tw: 連接

# DiskMgmt_Detach
source: Detach
zh_tw: 中斷連接

# DiskMgmt_OpenDiskManagement
source: Open Disk Management
zh_tw: 開啟磁碟管理

# DiskMgmt_Properties
source: Properties
zh_tw: 內容

# DiskMgmt_InitializeDisk
source: Initialize Disk
zh_tw: 初始化磁碟

# DiskMgmt_CreateSimpleVolume
source: Create Simple Volume
zh_tw: 建立簡單磁碟區

# DiskMgmt_Online
source: Online
zh_tw: 上線

# DiskMgmt_Offline
source: Offline
zh_tw: 離線

# DiskMgmt_SetReadOnly
source: Set Read-Only
zh_tw: 設定為唯讀

# DiskMgmt_ClearReadOnly
source: Clear Read-Only
zh_tw: 清除唯讀

# DiskMgmt_CleanDisk
source: Clean Disk
zh_tw: 清理磁碟

# DiskMgmt_SystemProtected
source: System Protected
zh_tw: 系統保護

# DiskMgmt_OpenInFileExplorer
source: Open in File Explorer
zh_tw: 在檔案總管中開啟

# DiskMgmt_NewSimpleVolume
source: New Simple Volume
zh_tw: 新增簡單磁碟區

# DiskMgmt_ManageDriveLetter
source: Manage Drive Letter
zh_tw: 管理磁碟機代號

# DiskMgmt_RemoveDriveLetter
source: Remove Drive Letter
zh_tw: 移除磁碟機代號

# DiskMgmt_MountToFolder
source: Mount to Folder
zh_tw: 掛接到資料夾

# DiskMgmt_ExtendVolume
source: Extend Volume
zh_tw: 延伸磁碟區

# DiskMgmt_ShrinkVolume
source: Shrink Volume
zh_tw: 壓縮磁碟區

# DiskMgmt_Format
source: Format
zh_tw: 格式化

# DiskMgmt_MarkAsActive
source: Mark as Active
zh_tw: 標示為使用中

# DiskMgmt_DeleteVolume
source: Delete Volume
zh_tw: 刪除磁碟區

# DiskMgmt_Eject
source: Eject
zh_tw: 退出

# DiskMgmt_EjectDiscTray
source: Eject disc tray
zh_tw: 退出光碟匣

# DiskMgmt_FormatVolume
source: Format Volume
zh_tw: 格式化磁碟區

# DiskMgmt_FormatWarning
source: Warning: Formatting will erase all data on this volume. Please back up any data you want to keep before formatting.
zh_tw: 警告：格式化將會清除此磁碟區上的所有資料。請在格式化之前備份您要保留的任何資料。

# DiskMgmt_Drive
source: Drive:
zh_tw: 磁碟機：

# DiskMgmt_VolumeLabel
source: Volume Label:
zh_tw: 磁碟區標籤：

# DiskMgmt_FileSystem
source: File System:
zh_tw: 檔案系統：

# DiskMgmt_AllocationUnitSize
source: Allocation Unit Size:
zh_tw: 配置單位大小：

# DiskMgmt_Default
source: Default
zh_tw: 預設

# DiskMgmt_PerformQuickFormat
source: Perform a quick format
zh_tw: 執行快速格式化

# DiskMgmt_EnableCompression
source: Enable file and folder compression
zh_tw: 啟用檔案和資料夾壓縮

# DiskMgmt_CreateVHD
source: Create Virtual Hard Disk
zh_tw: 建立虛擬硬碟

# DiskMgmt_Location
source: Location:
zh_tw: 位置：

# DiskMgmt_VHDSize
source: Virtual hard disk size (MiB):
zh_tw: 虛擬硬碟大小 (MiB)：

# DiskMgmt_VHDFormat
source: Virtual hard disk format:
zh_tw: 虛擬硬碟格式：

# DiskMgmt_VHDType
source: Virtual hard disk type:
zh_tw: 虛擬硬碟類型：

# DiskMgmt_FixedSize
source: Fixed size
zh_tw: 固定大小

# DiskMgmt_DynamicallyExpanding
source: Dynamically expanding (Recommended)
zh_tw: 動態擴充 (建議)

# DiskMgmt_AttachVHD
source: Attach Virtual Hard Disk
zh_tw: 連接虛擬硬碟

# DiskMgmt_VHDLocation
source: Location:
zh_tw: 位置：

# DiskMgmt_ReadOnly
source: Read-only
zh_tw: 唯讀

# DiskMgmt_InitializeDiskTitle
source: Initialize Disk
zh_tw: 初始化磁碟

# DiskMgmt_SelectPartitionStyle
source: Select the partition style for the selected disk:
zh_tw: 選取所選磁碟的磁碟分割樣式：

# DiskMgmt_MBR
source: MBR (Master Boot Record)
zh_tw: MBR (主開機記錄)

# DiskMgmt_GPT
source: GPT (GUID Partition Table)
zh_tw: GPT (GUID 磁碟分割表格)

# DiskMgmt_MBRDescription
source: For disks smaller than 2TB and compatibility with older systems
zh_tw: 適用於小於 2TB 的磁碟以及與舊系統的相容性

# DiskMgmt_GPTDescription
source: For disks larger than 2TB and modern systems with UEFI
zh_tw: 適用於大於 2TB 的磁碟以及具有 UEFI 的現代系統

# DiskMgmt_ShrinkVolumeTitle
source: Shrink Volume
zh_tw: 壓縮磁碟區

# DiskMgmt_TotalSizeBeforeShrink
source: Total size before shrink in MB:
zh_tw: 壓縮前的總大小 (MB)：

# DiskMgmt_SizeOfAvailableShrinkSpace
source: Size of available shrink space in MB:
zh_tw: 可用壓縮空間大小 (MB)：

# DiskMgmt_EnterAmountToShrink
source: Enter the amount of space to shrink in MB:
zh_tw: 輸入要壓縮的空間量 (MB)：

# DiskMgmt_TotalSizeAfterShrink
source: Total size after shrink in MB:
zh_tw: 壓縮後的總大小 (MB)：

# DiskMgmt_Shrink
source: Shrink
zh_tw: 壓縮

# DiskMgmt_ExtendVolumeTitle
source: Extend Volume
zh_tw: 延伸磁碟區

# DiskMgmt_SelectAmountOfSpace
source: Select the amount of space in MB:
zh_tw: 選取空間量 (MB)：

# DiskMgmt_MaximumAvailableSpace
source: Maximum available space in MB:
zh_tw: 最大可用空間 (MB)：

# DiskMgmt_SelectedSpace
source: Selected space in MB:
zh_tw: 選取的空間 (MB)：

# DiskMgmt_Extend
source: Extend
zh_tw: 延伸

# DiskMgmt_ManageDriveLetterTitle
source: Change Drive Letter and Paths
zh_tw: 變更磁碟機代號及路徑

# DiskMgmt_AssignDriveLetter
source: Assign the following drive letter:
zh_tw: 指派下列磁碟機代號：

# DiskMgmt_DoNotAssignDriveLetter
source: Do not assign a drive letter or drive path
zh_tw: 不要指派磁碟機代號或磁碟機路徑

# DiskMgmt_MountInEmptyNTFSFolder
source: Mount in the following empty NTFS folder:
zh_tw: 掛接在下列空的 NTFS 資料夾中：

# DiskMgmt_VolumeProperties
source: Volume Properties
zh_tw: 磁碟區內容

# DiskMgmt_General
source: General
zh_tw: 一般

# DiskMgmt_Type
source: Type:
zh_tw: 類型：

# DiskMgmt_UsedSpace
source: Used space:
zh_tw: 已使用空間：

# DiskMgmt_FreeSpace
source: Free space:
zh_tw: 可用空間：

# DiskMgmt_Capacity
source: Capacity:
zh_tw: 容量：

# DiskMgmt_DiskProperties
source: Disk Properties
zh_tw: 磁碟內容

# DiskMgmt_Model
source: Model:
zh_tw: 型號：

# DiskMgmt_Interface
source: Interface:
zh_tw: 介面：

# DiskMgmt_Status
source: Status:
zh_tw: 狀態：

# DiskMgmt_PartitionStyle
source: Partition style:
zh_tw: 磁碟分割樣式：

# DiskMgmt_CreateSimpleVolumeTitle
source: Create Simple Volume
zh_tw: 建立簡單磁碟區

# DiskMgmt_Disk
source: Disk:
zh_tw: 磁碟：

# DiskMgmt_VolumeSizeMB
source: Volume Size (MB):
zh_tw: 磁碟區大小 (MB)：

# DiskMgmt_DriveLetter
source: Drive Letter:
zh_tw: 磁碟機代號：

# DiskMgmt_NewVolume
source: New Volume
zh_tw: 新磁碟區

# DiskMgmt_DeleteVolumeTitle
source: Delete Volume
zh_tw: 刪除磁碟區

# DiskMgmt_DeleteVolumeWarning
source: WARNING: Deleting a volume will permanently erase all data on it. This action cannot be undone.
zh_tw: 警告：刪除磁碟區將永久清除其上的所有資料。此動作無法復原。

# DiskMgmt_Volume
source: Volume:
zh_tw: 磁碟區：

# DiskMgmt_ConfirmDeleteVolume
source: I understand that all data on this volume will be permanently erased
zh_tw: 我了解此磁碟區上的所有資料將被永久清除

# DiskMgmt_CleanDiskTitle
source: Clean Disk
zh_tw: 清理磁碟

# DiskMgmt_CleanDiskWarning
source: WARNING: Cleaning a disk will permanently erase all data on the disk. This action cannot be undone.
zh_tw: 警告：清理磁碟將永久清除磁碟上的所有資料。此動作無法復原。

# DiskMgmt_ConfirmCleanDisk
source: I understand that all data on this disk will be permanently erased
zh_tw: 我了解此磁碟上的所有資料將被永久清除

# DiskMgmt_CDROMPropertiesTitle
source: CD-ROM Properties
zh_tw: CD-ROM 內容

# DiskMgmt_Name
source: Name:
zh_tw: 名稱：

# DiskMgmt_Manufacturer
source: Manufacturer:
zh_tw: 製造商：

# DiskMgmt_Media
source: Media
zh_tw: 媒體

# DiskMgmt_MediaLoaded
source: Media Loaded:
zh_tw: 已載入媒體：

# DiskMgmt_VolumeName
source: Volume Name:
zh_tw: 磁碟區名稱：

# DiskMgmt_MediaType
source: Media Type:
zh_tw: 媒體類型：

# DiskMgmt_Size
source: Size:
zh_tw: 大小：

# DiskMgmt_Hardware
source: Hardware
zh_tw: 硬體

# DiskMgmt_SCSIBus
source: SCSI Bus:
zh_tw: SCSI 匯流排：

# DiskMgmt_SCSIPort
source: SCSI Port:
zh_tw: SCSI 連接埠：

# DiskMgmt_SCSITarget
source: SCSI Target:
zh_tw: SCSI 目標：

# DiskMgmt_MarkPartitionActiveTitle
source: Mark Partition as Active
zh_tw: 標示分割區為使用中

# DiskMgmt_MarkActive
source: Mark Active
zh_tw: 標示為使用中

# DiskMgmt_MarkActiveWarning
source: This is typically used for boot partitions on MBR disks.
zh_tw: 這通常用於 MBR 磁碟上的開機分割區。

# DiskMgmt_MarkActiveConfirm
source: Are you sure you want to mark this partition as active? Marking the wrong partition as active may prevent your system from booting.
zh_tw: 您確定要將此分割區標示為使用中嗎？標示錯誤的分割區為使用中可能會導致系統無法開機。

# DiskMgmt_MountToFolderTitle
source: Mount Volume to Folder
zh_tw: 將磁碟區掛載到資料夾

# DiskMgmt_Mount
source: Mount
zh_tw: 掛載

# DiskMgmt_MountPoint
source: Mount Point (Folder Path):
zh_tw: 掛載點（資料夾路徑）：

# DiskMgmt_MountInfo
source: The folder must be empty and on an NTFS volume. Mounting to a folder allows you to access the volume's content through a folder path instead of a drive letter.
zh_tw: 資料夾必須是空的且位於 NTFS 磁碟區上。掛載到資料夾可讓您透過資料夾路徑而非磁碟機代號來存取磁碟區的內容。

# DiskMgmt_RemoveDriveLetterTitle
source: Remove Drive Letter
zh_tw: 移除磁碟機代號

# DiskMgmt_RemoveDriveLetterConfirm
source: Are you sure you want to remove the drive letter {0} from this volume?
zh_tw: 您確定要從此磁碟區移除磁碟機代號 {0} 嗎？

# DiskMgmt_Warning
source: Warning
zh_tw: 警告

# DiskMgmt_VHDOperations
source: Attach/Detach
zh_tw: 連接/中斷

# DiskMgmt_AccessDenied_Operation
source: {0}: Access denied. Administrator privileges required.
zh_tw: {0}：存取被拒。需要系統管理員權限。

# DiskMgmt_AccessDenied_AdminRequired
source: Access denied (Administrator privileges required)
zh_tw: 存取被拒（需要系統管理員權限）

# DiskMgmt_DiskLabel
source: Disk
zh_tw: 磁碟

# DiskMgmt_Healthy
source: Healthy
zh_tw: 狀況良好

# DiskMgmt_HealthWarning
source: Warning
zh_tw: 警告

# DiskMgmt_HealthUnhealthy
source: Unhealthy
zh_tw: 不良

# DiskMgmt_HealthUnknown
source: Unknown
zh_tw: 未知

# DiskMgmt_Unallocated
source: Unallocated
zh_tw: 未配置

# DiskMgmt_UnallocatedSpace
source: Unallocated Space
zh_tw: 未配置空間

# DiskMgmt_LocalDiskLabel
source: Local Disk
zh_tw: 本機磁碟

# DiskMgmt_NoLabel
source: No Label
zh_tw: 無標籤

# DiskMgmt_NoMedia
source: No media
zh_tw: 無媒體

# DiskMgmt_MediaLoadedLabel
source: Media loaded:
zh_tw: 已載入媒體：

# DiskMgmt_Usage
source: Usage:
zh_tw: 使用率：

# DiskMgmt_Health
source: Health:
zh_tw: 健康狀態：

# DiskMgmt_Bootable
source: Bootable:
zh_tw: 可開機：

# DiskMgmt_Primary
source: Primary:
zh_tw: 主要分割區：

# DiskMgmt_Advanced
source: Advanced
zh_tw: 進階

# DiskMgmt_DeviceId
source: Device ID:
zh_tw: 裝置 ID：

# DiskMgmt_StartingOffset
source: Starting Offset:
zh_tw: 起始位移：

# DiskMgmt_BlockSize
source: Block Size:
zh_tw: 區塊大小：

# DiskMgmt_VolumeSerial
source: Volume Serial:
zh_tw: 磁碟區序號：

# DiskMgmt_SerialNumber
source: Serial Number:
zh_tw: 序號：

# DiskMgmt_Partitions
source: Partitions:
zh_tw: 分割區數：

# DiskMgmt_Firmware
source: Firmware:
zh_tw: 韌體：

# DiskMgmt_BytesPerSector
source: Bytes/Sector:
zh_tw: 每磁區位元組：

# DiskMgmt_TotalSectors
source: Total Sectors:
zh_tw: 總磁區數：

# DiskMgmt_TotalCylinders
source: Total Cylinders:
zh_tw: 總磁柱數：

# DiskMgmt_TotalHeads
source: Total Heads:
zh_tw: 總磁頭數：

# DiskMgmt_VirtualDisk
source: Virtual Disk
zh_tw: 虛擬磁碟

# DiskMgmt_IsVirtual
source: Virtual:
zh_tw: 虛擬：

# DiskMgmt_Yes
source: Yes
zh_tw: 是

# DiskMgmt_OemRecoveryPartition
source: OEM Recovery Partition
zh_tw: OEM 復原分割區

# DiskMgmt_OemRecoveryWarning
source: ⚠️ OEM Recovery Partition - This partition contains manufacturer recovery resources; do not modify it.
zh_tw: ⚠️ OEM 復原分割區 - 此分割區包含製造商的系統復原資源，請勿修改。

# DiskMgmt_CannotDeleteOemRecoveryPartition
source: Cannot delete OEM Recovery Partition. This partition is used by the manufacturer for system recovery.
zh_tw: 無法刪除 OEM 復原分割區。製造商使用此分割區進行系統復原。

# DiskMgmt_ErrorTitle
source: Error
zh_tw: 錯誤

# DiskMgmt_Result_VhdCreateFailed
source: VHD Creation Failed
zh_tw: 建立 VHD 失敗

# DiskMgmt_Result_VhdAttachFailed
source: VHD Attach Failed
zh_tw: 連接 VHD 失敗

# DiskMgmt_Result_VhdDetachFailed
source: Detach VHD Failed
zh_tw: 中斷連接 VHD 失敗

# DiskMgmt_Result_EjectFailed
source: Eject Failed
zh_tw: 退出失敗

# DiskMgmt_Result_AssignDriveLetterFailed
source: Assign Drive Letter Failed
zh_tw: 指派磁碟機代號失敗

# DiskMgmt_Result_ChangeDriveLetterFailed
source: Change Drive Letter Failed
zh_tw: 變更磁碟機代號失敗

# DiskMgmt_Result_FormatFailed
source: Format Volume Failed
zh_tw: 格式化磁碟區失敗

# DiskMgmt_Result_InitializeFailed
source: Initialize Disk Failed
zh_tw: 初始化磁碟失敗

# DiskMgmt_Result_CreateVolumeFailed
source: Create Volume Failed
zh_tw: 建立磁碟區失敗

# DiskMgmt_Result_SetOnlineFailed
source: Set Online Failed
zh_tw: 設定上線失敗

# DiskMgmt_Result_SetOfflineFailed
source: Set Offline Failed
zh_tw: 設定離線失敗

# DiskMgmt_Result_SetReadOnlyFailed
source: Set Read-Only Failed
zh_tw: 設定唯讀失敗

# DiskMgmt_Result_ClearReadOnlyFailed
source: Clear Read-Only Failed
zh_tw: 清除唯讀失敗

# DiskMgmt_Result_CleanFailed
source: Clean Disk Failed
zh_tw: 清理磁碟失敗

# DiskMgmt_Result_DeleteVolumeFailed
source: Delete Volume Failed
zh_tw: 刪除磁碟區失敗

# DiskMgmt_Result_ExtendFailed
source: Extend Volume Failed
zh_tw: 延伸磁碟區失敗

# DiskMgmt_Result_ShrinkFailed
source: Shrink Volume Failed
zh_tw: 壓縮磁碟區失敗

# DiskMgmt_Result_RemoveDriveLetterFailed
source: Remove Drive Letter Failed
zh_tw: 移除磁碟機代號失敗

# DiskMgmt_Result_MountFailed
source: Mount to Folder Failed
zh_tw: 掛接到資料夾失敗

# DiskMgmt_Result_MarkActiveFailed
source: Mark Active Failed
zh_tw: 標示為使用中失敗

# DiskMgmt_Result_QueryFailed
source: Query Failed
zh_tw: 查詢失敗

# DiskMgmt_Result_NoSpaceAvailable
source: No Space Available
zh_tw: 沒有可用空間

# DiskMgmt_Result_OperationNotSupported
source: Operation Not Supported
zh_tw: 不支援此作業

# DiskMgmt_Msg_CannotFormatWithoutLetter
source: Cannot format a partition without a drive letter.
zh_tw: 無法格式化沒有磁碟機代號的分割區。

# DiskMgmt_Msg_InvalidCdrom
source: Invalid CD-ROM drive.
zh_tw: 無效的 CD-ROM 光碟機。

# DiskMgmt_Msg_ResizeNotSupported
source: This partition type (System/Reserved/Recovery) does not support resizing operations.
zh_tw: 此分割區類型 (系統/保留/復原) 不支援調整大小作業。

# DiskMgmt_Msg_NoExtendSpace
source: No unallocated space available for extension.
zh_tw: 沒有可供延伸的未配置空間。

# DiskMgmt_Msg_ExtendNeedsLetter
source: Extending partitions without drive letters is not yet supported. Please assign a drive letter first.
zh_tw: 目前尚不支援延伸沒有磁碟機代號的分割區。請先指派磁碟機代號。

# DiskMgmt_Msg_NoShrinkSpace
source: No shrinkable space available. This may be due to unmovable files.
zh_tw: 沒有可壓縮的空間。這可能是因為有無法移動的檔案。

# DiskMgmt_Msg_ShrinkSizeZero
source: Shrink size must be greater than 0.
zh_tw: 壓縮大小必須大於 0。

# DiskMgmt_Msg_ShrinkNeedsLetter
source: Shrinking partitions without drive letters is not yet supported. Please assign a drive letter first.
zh_tw: 目前尚不支援壓縮沒有磁碟機代號的分割區。請先指派磁碟機代號。

# DiskMgmt_Msg_NoDriveLetter
source: This partition does not have a drive letter.
zh_tw: 此分割區沒有磁碟機代號。

# DiskMgmt_Msg_CannotMountWithoutLetter
source: Cannot mount a partition without a drive letter.
zh_tw: 無法掛接沒有磁碟機代號的分割區。

# DiskMgmt_FileFilter_Vhd
source: Virtual Hard Disk
zh_tw: 虛擬硬碟

# DiskMgmt_FileFilter_Vhdx
source: Virtual Hard Disk (*.vhdx)
zh_tw: 虛擬硬碟 (*.vhdx)

# DiskMgmt_FileFilter_VhdLegacy
source: Virtual Hard Disk (*.vhd)
zh_tw: 虛擬硬碟 (*.vhd)

# DiskMgmt_SelectVhdToDetach
source: Select Virtual Hard Disk to Detach
zh_tw: 選取要中斷連接的虛擬硬碟

# DiskMgmt_SelectVhd
source: Select Virtual Hard Disk
zh_tw: 選取虛擬硬碟

# DiskMgmt_SelectPlaceholder
source: Select
zh_tw: 選取

# DiskMgmt_Alloc512
source: 512 bytes
zh_tw: 512 位元組

# DiskMgmt_Alloc1024
source: 1024 bytes
zh_tw: 1024 位元組

# DiskMgmt_Alloc2048
source: 2048 bytes
zh_tw: 2048 位元組

# DiskMgmt_Alloc4096
source: 4096 bytes
zh_tw: 4096 位元組

# DiskMgmt_Alloc8192
source: 8192 bytes
zh_tw: 8192 位元組

# DiskMgmt_DiskInfoFormat
source: Disk {0} - {1}
zh_tw: 磁碟 {0} - {1}

# DiskMgmt_MaxSizeFormat
source: Maximum size: {0} MB (Minimum: {1} MB)
zh_tw: 最大大小: {0} MB (最小: {1} MB)

# DiskMgmt_NoShrinkSpaceShort
source: 0 MB (No shrinkable space available)
zh_tw: 0 MB (沒有可壓縮的空間)

# DiskMgmt_DriveCountSingular
source: {0} drive
zh_tw: {0} 部磁碟機

# DiskMgmt_DriveCountPlural
source: {0} drives
zh_tw: {0} 部磁碟機

# DiskMgmt_Status_Loading
source: Loading disk information...
zh_tw: 正在載入磁碟資訊...

# DiskMgmt_Status_LoadedFormat
source: Loaded {0} disk(s), {1} partition(s), {2} CD/DVD drive(s)
zh_tw: 已載入 {0} 個磁碟、{1} 個分割區、{2} 部 CD/DVD 光碟機

# DiskMgmt_Status_StoragePoolsSuffixFormat
source: , {0} storage pool(s)
zh_tw: 、{0} 個存放集區

# DiskMgmt_Status_LoadErrorFormat
source: Error loading disks: {0}
zh_tw: 載入磁碟時發生錯誤: {0}

# DiskMgmt_Status_Refreshing
source: Refreshing...
zh_tw: 正在重新整理...

# DiskMgmt_Status_RefreshErrorFormat
source: Error refreshing: {0}
zh_tw: 重新整理時發生錯誤: {0}

# DiskMgmt_Status_FailedFormat
source: Failed: {0}
zh_tw: 失敗: {0}

# DiskMgmt_Status_ErrorFormat
source: Error: {0}
zh_tw: 錯誤: {0}

# DiskMgmt_Status_CreatingVhd
source: Creating virtual hard disk...
zh_tw: 正在建立虛擬硬碟...

# DiskMgmt_Status_CreateVhdErrorFormat
source: Error creating VHD: {0}
zh_tw: 建立 VHD 時發生錯誤: {0}

# DiskMgmt_Status_AttachingVhd
source: Attaching virtual hard disk...
zh_tw: 正在連接虛擬硬碟...

# DiskMgmt_Status_AttachVhdErrorFormat
source: Error attaching VHD: {0}
zh_tw: 連接 VHD 時發生錯誤: {0}

# DiskMgmt_Status_DetachingVhd
source: Detaching virtual hard disk...
zh_tw: 正在中斷連接虛擬硬碟...

# DiskMgmt_Status_DetachVhdErrorFormat
source: Error detaching VHD: {0}
zh_tw: 中斷連接 VHD 時發生錯誤: {0}

# DiskMgmt_Status_EjectingMedia
source: Ejecting media...
zh_tw: 正在退出媒體...

# DiskMgmt_Status_EjectErrorFormat
source: Error ejecting media: {0}
zh_tw: 退出媒體時發生錯誤: {0}

# DiskMgmt_Status_LoadingMedia
source: Loading media...
zh_tw: 正在載入媒體...

# DiskMgmt_Status_LoadMediaErrorFormat
source: Error loading media: {0}
zh_tw: 載入媒體時發生錯誤: {0}

# DiskMgmt_Status_ChangingDriveLetter
source: Changing drive letter...
zh_tw: 正在變更磁碟機代號...

# DiskMgmt_Status_ChangeDriveLetterErrorFormat
source: Error changing drive letter: {0}
zh_tw: 變更磁碟機代號時發生錯誤: {0}

# DiskMgmt_Status_RemovingDriveLetter
source: Removing drive letter...
zh_tw: 正在移除磁碟機代號...

# DiskMgmt_Status_RemoveDriveLetterErrorFormat
source: Error removing drive letter: {0}
zh_tw: 移除磁碟機代號時發生錯誤: {0}

# DiskMgmt_Status_AssigningDriveLetter
source: Assigning drive letter...
zh_tw: 正在指派磁碟機代號...

# DiskMgmt_Status_AssignDriveLetterErrorFormat
source: Error assigning drive letter: {0}
zh_tw: 指派磁碟機代號時發生錯誤: {0}

# DiskMgmt_Status_ManageDriveLetterErrorFormat
source: Error managing drive letter: {0}
zh_tw: 管理磁碟機代號時發生錯誤: {0}

# DiskMgmt_Status_ConsoleOpened
source: Disk Management console opened
zh_tw: 已開啟磁碟管理主控台

# DiskMgmt_Status_OpenConsoleErrorFormat
source: Error opening Disk Management: {0}
zh_tw: 開啟磁碟管理時發生錯誤: {0}

# DiskMgmt_Status_BringingOnline
source: Bringing disk online...
zh_tw: 正在讓磁碟上線...

# DiskMgmt_Status_TakingOffline
source: Taking disk offline...
zh_tw: 正在讓磁碟離線...

# DiskMgmt_Status_Formatting
source: Formatting volume...
zh_tw: 正在格式化磁碟區...

# DiskMgmt_Status_FormatErrorFormat
source: Error formatting volume: {0}
zh_tw: 格式化磁碟區時發生錯誤: {0}

# DiskMgmt_Status_InitializingFormat
source: Initializing disk {0}...
zh_tw: 正在初始化磁碟 {0}...

# DiskMgmt_Status_InitializeErrorFormat
source: Error initializing disk: {0}
zh_tw: 初始化磁碟時發生錯誤: {0}

# DiskMgmt_Status_CreatingVolume
source: Creating volume...
zh_tw: 正在建立磁碟區...

# DiskMgmt_Status_CreateVolumeErrorFormat
source: Error creating volume: {0}
zh_tw: 建立磁碟區時發生錯誤: {0}

# DiskMgmt_Status_DeletingVolume
source: Deleting volume...
zh_tw: 正在刪除磁碟區...

# DiskMgmt_Status_DeleteVolumeErrorFormat
source: Error deleting volume: {0}
zh_tw: 刪除磁碟區時發生錯誤: {0}

# DiskMgmt_Status_Extending
source: Extending volume...
zh_tw: 正在延伸磁碟區...

# DiskMgmt_Status_ExtendErrorFormat
source: Error extending volume: {0}
zh_tw: 延伸磁碟區時發生錯誤: {0}

# DiskMgmt_Status_Shrinking
source: Shrinking volume...
zh_tw: 正在壓縮磁碟區...

# DiskMgmt_Status_ShrinkErrorFormat
source: Error shrinking volume: {0}
zh_tw: 壓縮磁碟區時發生錯誤: {0}

# DiskMgmt_Status_MarkingActive
source: Marking partition as active...
zh_tw: 正在將分割區標示為使用中...

# DiskMgmt_Status_MarkActiveErrorFormat
source: Error marking partition as active: {0}
zh_tw: 將分割區標示為使用中時發生錯誤: {0}

# DiskMgmt_Status_Mounting
source: Mounting volume to folder...
zh_tw: 正在將磁碟區掛接到資料夾...

# DiskMgmt_Status_MountErrorFormat
source: Error mounting volume: {0}
zh_tw: 掛接磁碟區時發生錯誤: {0}

# DiskMgmt_Status_Cleaning
source: Cleaning disk...
zh_tw: 正在清理磁碟...

# DiskMgmt_Status_CleanErrorFormat
source: Error cleaning disk: {0}
zh_tw: 清理磁碟時發生錯誤: {0}

# DiskMgmt_Status_SettingReadOnly
source: Setting disk as read-only...
zh_tw: 正在將磁碟設為唯讀...

# DiskMgmt_Status_ClearingReadOnly
source: Clearing read-only attribute...
zh_tw: 正在清除唯讀屬性...

# DiskMgmt_Err_DriveLetterEmpty
source: Drive letter cannot be empty.
zh_tw: 磁碟機代號不可為空白。

# DiskMgmt_Err_SizeRequired
source: Size must be greater than 0.
zh_tw: 大小必須大於 0。

# DiskMgmt_Err_DiskNotFound
source: Specified disk not found.
zh_tw: 找不到指定的磁碟。

# DiskMgmt_Err_PartitionNotFound
source: Specified partition not found.
zh_tw: 找不到指定的分割區。

# DiskMgmt_Err_VolumeNotFound
source: Volume not found.
zh_tw: 找不到磁碟區。

# DiskMgmt_Err_DriveLetterInUse
source: Drive letter is already in use.
zh_tw: 磁碟機代號已在使用中。

# DiskMgmt_Err_DriveLetterSame
source: New and old drive letters are the same.
zh_tw: 新舊磁碟機代號相同。

# DiskMgmt_Err_FolderNotExist
source: Folder does not exist.
zh_tw: 資料夾不存在。

# DiskMgmt_Err_DriveNotReady
source: Drive is not ready.
zh_tw: 磁碟機尚未就緒。

# DiskMgmt_Err_NoExtensionSpace
source: No available space for extension.
zh_tw: 沒有可供延伸的空間。

# DiskMgmt_Err_NoAccessPath
source: This partition does not have a drive letter assigned.
zh_tw: 此分割區未指派磁碟機代號。

# DiskMgmt_Err_SystemDriveFormat
source: ⚠️ Formatting system drive is strictly prohibited! Drive '{0}' contains the Windows operating system. Formatting it will make the system unbootable.
zh_tw: ⚠️ 嚴禁格式化系統磁碟機！磁碟機 '{0}' 包含 Windows 作業系統，格式化後系統將無法開機。

# DiskMgmt_Err_SystemDriveLetterRemoval
source: ⚠️ Removing system drive letter is strictly prohibited! Drive '{0}' contains the Windows operating system. Removing it will cause system malfunction.
zh_tw: ⚠️ 嚴禁移除系統磁碟機代號！磁碟機 '{0}' 包含 Windows 作業系統，移除後將導致系統運作異常。

# DiskMgmt_Err_SystemDiskClean
source: ⚠️ Strictly forbidden to clean system disk! This disk contains the Windows operating system, cleaning will make the system unbootable.
zh_tw: ⚠️ 嚴禁清理系統磁碟！此磁碟包含 Windows 作業系統，清理後系統將無法開機。

# DiskMgmt_Err_CriticalPartitionsOnDisk
source: ⚠️ This disk contains critical system partitions (EFI, Recovery partition), cleaning may cause system boot failure.
zh_tw: ⚠️ 此磁碟包含重要的系統分割區 (EFI、復原分割區)，清理後可能導致系統無法開機。

# DiskMgmt_Err_CannotDeleteSystemPartition
source: ⚠️ Cannot perform this operation on system partition. Drive "{0}" contains the Windows operating system.
zh_tw: ⚠️ 無法對系統分割區執行此作業。磁碟機 "{0}" 包含 Windows 作業系統。

# DiskMgmt_Err_CannotDeleteEfiPartition
source: ⚠️ Cannot delete EFI System Partition. This partition is required for boot.
zh_tw: ⚠️ 無法刪除 EFI 系統分割區。開機時需要此分割區。

# DiskMgmt_Err_CannotDeleteRecoveryPartition
source: ⚠️ Cannot delete Recovery Partition. This partition is used for system recovery.
zh_tw: ⚠️ 無法刪除復原分割區。此分割區用於系統復原。

# DiskMgmt_Err_CannotDeleteMsrPartition
source: ⚠️ Cannot delete Microsoft Reserved Partition. This partition is required for system operation.
zh_tw: ⚠️ 無法刪除 Microsoft 保留分割區。系統運作需要此分割區。

# DiskMgmt_Err_CriticalSystemPartition
source: ⚠️ Cannot perform this operation on this critical system partition.
zh_tw: ⚠️ 無法對此重要的系統分割區執行此作業。

# DiskMgmt_Err_SpecialPartitionOperation
source: This partition type (System/Reserved/Recovery) does not support this operation.
zh_tw: 此分割區類型 (系統/保留/復原) 不支援此作業。

# DiskMgmt_Err_PartitionNotSupportResize
source: This partition does not support resizing. It may be a system, recovery, or special partition type.
zh_tw: 此分割區不支援調整大小，它可能是系統、復原或特殊的分割區類型。

# DiskMgmt_Err_MbrOnly
source: Only MBR disks support marking active partition. GPT disks use EFI system partition for boot.
zh_tw: 只有 MBR 磁碟支援標示使用中的分割區。GPT 磁碟使用 EFI 系統分割區開機。

# DiskMgmt_Err_DiskMustBeCleanedBeforeConversion
source: Disk must be cleaned of all partitions before conversion. Please use 'Clean Disk' function first.
zh_tw: 轉換前必須先清除磁碟上的所有分割區。請先使用 [清理磁碟] 功能。

# DiskMgmt_Err_DiskAlreadyGpt
source: Disk is already GPT format.
zh_tw: 磁碟已經是 GPT 格式。

# DiskMgmt_Err_DiskAlreadyMbr
source: Disk is already MBR format.
zh_tw: 磁碟已經是 MBR 格式。

# DiskMgmt_Err_DiskAlreadyDynamic
source: Disk is already a dynamic disk.
zh_tw: 磁碟已經是動態磁碟。

# DiskMgmt_Err_DiskAlreadyBasic
source: Disk is already a basic disk.
zh_tw: 磁碟已經是基本磁碟。

# DiskMgmt_Err_VhdPathEmpty
source: VHD path cannot be empty.
zh_tw: VHD 路徑不可為空白。

# DiskMgmt_Err_VhdFileNotFound
source: VHD file not found.
zh_tw: 找不到 VHD 檔案。

# DiskMgmt_Err_VhdFileAlreadyExists
source: VHD file already exists.
zh_tw: VHD 檔案已經存在。

# DiskMgmt_Err_VhdFileInUse
source: File is being used by another process.
zh_tw: 檔案正由另一個處理程序使用。
